app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `event`
SELECT COUNT(*) AS `numrows`
FROM `booking`
SELECT `booking`.`id`, `customer`.`name` as `customer_name`, `event`.`event_name`, `event`.`location`, `event`.`booking_ticket`, `booking`.`qty`, (event.booking_ticket * booking.qty) as total
FROM `booking`
JOIN `customer` ON `customer`.`id` = `booking`.`customer_id`
JOIN `event` ON `event`.`id` = `booking`.`event_id`
ORDER BY `booking_date` DESC
 LIMIT 5
---
    public function dashboard()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $customerModel = new CustomerModel();
        $eventModel = new EventModel();
        $bookingModel = new BookingModel();

        $totalCustomers = $customerModel->countAllResults();
        $totalEvents = $eventModel->countAllResults();
        $totalBookings = $bookingModel->countAllResults();

        $latestBookings = $bookingModel
            ->select('booking.id, customer.name as customer_name, event.event_name, event.location, event.booking_ticket, booking.qty, (event.booking_ticket * booking.qty) as total')
            ->join('customer', 'customer.id = booking.customer_id')
            ->join('event', 'event.id = booking.event_id')
            ->orderBy('booking_date', 'DESC')
            ->findAll(5);

SELECT `event`.`event_name` as `title`, `booking_date` as `start`, `customer`.`name` as `customerName`, `event`.`location` as `eventLocation`, `event`.`booking_ticket` as `eventPrice`, `booking`.`qty` as `bookingQty`, (event.booking_ticket * booking.qty) as bookingTotal, `event`.`category_id` as `eventCategory`
FROM `booking`
JOIN `event` ON `event`.`id` = `booking`.`event_id`
JOIN `customer` ON `customer`.`id` = `booking`.`customer_id`
---
    public function getEvents()
    {
        $bookingModel = new BookingModel();
        $events = $bookingModel
            ->select('event.event_name as title, booking_date as start, customer.name as customerName, event.location as eventLocation, event.booking_ticket as eventPrice, booking.qty as bookingQty, (event.booking_ticket * booking.qty) as bookingTotal, event.category_id as eventCategory')
            ->join('event', 'event.id = booking.event_id')
            ->join('customer', 'customer.id = booking.customer_id')
            ->findAll();