app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `customer`
SELECT COUNT(*) AS `numrows`
FROM `products`
SELECT COUNT(*) AS `numrows`
FROM `orders`
SELECT `orders`.`id`, `customer`.`name` as `customer_name`, `products`.`product_name`, `orders`.`quantity`, `products`.`price`, (orders.quantity * products.price) as total, `orders`.`order_date`
FROM `orders`
JOIN `customer` ON `customer`.`id` = `orders`.`customer_id`
JOIN `products` ON `products`.`id` = `orders`.`product_id`
ORDER BY `orders`.`order_date` DESC
 LIMIT 5
---
    public function dashboard()
    {
        // Check if the user is logged in
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        // Initialize models
        $customerModel = new CustomerModel();
        $productModel = new ProductModel();
        $orderModel = new OrderModel();

        // Get counts for dashboard
        $totalCustomers = $customerModel->countAllResults();
        $totalProducts = $productModel->countAllResults();
        $totalOrders = $orderModel->countAllResults();

        // Get the latest 5 orders
        $latestOrders = $orderModel
            ->select('orders.id, customer.name as customer_name, products.product_name, orders.quantity, products.price, (orders.quantity * products.price) as total, orders.order_date')
            ->join('customer', 'customer.id = orders.customer_id')
            ->join('products', 'products.id = orders.product_id')
            ->orderBy('orders.order_date', 'DESC')
            ->findAll(5);