app/Controllers/BookingController.php

    public function view()
    {
        $bookingModel = new BookingModel();

        $bookings = $bookingModel
            ->select('booking.id, customer.name as customer_name, event.event_name, event.location, event.booking_ticket, booking.qty, booking.total, booking.booking_date')
            ->join('customer', 'customer.id = booking.customer_id')
            ->join('event', 'event.id = booking.event_id')
            ->findAll();
---
SELECT `booking`.`id`, `customer`.`name` as `customer_name`, `event`.`event_name`, `event`.`location`, `event`.`booking_ticket`, `booking`.`qty`, `booking`.`total`, `booking`.`booking_date`
FROM `booking`
JOIN `customer` ON `customer`.`id` = `booking`.`customer_id`
JOIN `event` ON `event`.`id` = `booking`.`event_id`

    public function create()
    {
        $customerModel = new CustomerModel();
        $eventModel = new EventModel();

        $customers = $customerModel->findAll();
        $events = $eventModel->findAll();
---
SELECT *
FROM `customer`
SELECT *
FROM `event`

    public function submitBooking()
    {
        $request = $this->request;

        $bookingData = $request->getPost('booking_data');

        $bookingModel = new BookingModel();

        foreach ($bookingData as $data) {
            $bookingModel->insert([
                'customer_id' => $data['customer_id'],
                'event_id' => $data['event_id'],
                'qty' => $data['qty'],
                'total' => $data['total']
            ]);
---
INSERT INTO `booking` (`customer_id`, `event_id`, `qty`, `total`) VALUES ('19', '4', '2', '20000')