app/Controllers/Customer.php

SELECT *
FROM `customer`
---
    public function fetchAll()
    {
        $customerModel = new \App\Models\CustomerModel();
        $customers = $customerModel->findAll();

SELECT *
FROM `customer`
WHERE `customer`.`id` = '5'
SELECT *
FROM `orders`
WHERE `customer_id` = '5'
---
    public function delete($id)
    {
        $customerModel = new \App\Models\CustomerModel();
        $orderModel = new \App\Models\OrderModel();

        $customer = $customerModel->find($id);
        if (!$customer) {
            return $this->response->setJSON(['success' => false, 'message' => 'Customer not found.']);
        }

        $orders = $orderModel->where('customer_id', $id)->findAll();