app/Controllers/EventController.php

SELECT *
FROM `category`
---
    public function create()
    {
        $categoryModel = new CategoryModel();
        $categories = $categoryModel->findAll();

SELECT *
FROM `event`
WHERE `event`.`id` = '4'
---
    public function fetchEvent($id)
    {
        $eventModel = new EventModel();
        $event = $eventModel->find($id);