app/Controllers/OrderController.php

    public function fetchOrders()
    {
        $orderModel = new OrderModel();
        $orders = $orderModel
            ->select('orders.id, customer.name as customer_name, products.product_name, products.price, orders.quantity, orders.total, orders.order_date')
            ->join('customer', 'customer.id = orders.customer_id')
            ->join('products', 'products.id = orders.product_id')
            ->findAll();
---
SELECT `orders`.`id`, `customer`.`name` as `customer_name`, `products`.`product_name`, `products`.`price`, `orders`.`quantity`, `orders`.`total`, `orders`.`order_date`
FROM `orders`
JOIN `customer` ON `customer`.`id` = `orders`.`customer_id`
JOIN `products` ON `products`.`id` = `orders`.`product_id`