app/Controllers/ProductController.php

SELECT *
FROM `products`
WHERE `products`.`id` = '5'
---
    public function fetchProduct($id)
    {
        $productModel = new ProductModel();
        $product = $productModel->find($id);

SELECT *
FROM `products`
WHERE `products`.`id` = '6'
---
    public function update()
    {
        $id = $this->request->getPost('id');
        $productModel = new ProductModel();
        $product = $productModel->find($id);

SELECT *
FROM `products`
SELECT *
FROM `category`
WHERE `category`.`id` = '4'
---
    public function fetchAll()
    {
        $productModel = new ProductModel();
        $categoryModel = new CategoryModel();

        $events = $productModel->findAll();
        foreach ($events as &$event) {
            $category = $categoryModel->find($event['category_id']);